{"pageProps":{"readme":"# NomaiVR - Outer Wilds VR Mod\n\n![NomaiVR](RepoAssets/banner.png)\n\n[![Support on Patreon](RepoAssets/patreon-button.png)](https://www.patreon.com/raivr)\n[![Donate with PayPal](RepoAssets/paypal-button.png)](https://paypal.me/raicuparta/5usd)\n\n[![NomaiVR Video](RepoAssets/video-thumbnail.jpg)](https://www.youtube.com/watch?v=gPFiYRMm8Ok)\n\n<!-- TOC -->\n\n- [Installation](#installation)\n  - [Easy installation (recommended)](#easy-installation-recommended)\n  - [Manual installation](#manual-installation)\n- [Requirements](#requirements)\n- [Comfort](#comfort)\n- [VR Controller Inputs](#vr-controller-inputs)\n- [Performance](#performance)\n  - [Framerate](#framerate)\n- [Compatibility with other mods](#compatibility-with-other-mods)\n- [Reporting bugs / making requests](#reporting-bugs--making-requests)\n- [Contributing](#contributing)\n- [Development Setup](#development-setup)\n- [Special Thanks](#special-thanks)\n- [Help / Discuss development / Tell me about your day](#help--discuss-development--tell-me-about-your-day)\n\n<!-- /TOC -->\n\n## Installation\n\n### Easy installation (recommended)\n\n- Get the Mod Manager from the [Outer Wilds Mods](https://outerwildsmods.com/) website;\n- Install NomaiVR from the mod list displayed in the application;\n- If you can't get the mod manager to work, follow the instructions for manual installation.\n\n### Manual installation\n\n- [Install OWML](https://github.com/amazingalek/owml#installation);\n- [Download the latest NomaiVR release (Raicuparta.NomaiVR.zip)](https://github.com/Raicuparta/NomaiVR/releases/latest);\n- Extract the `Raicuparta.NomaiVR` directory to the `OWML/Mods` directory;\n- Run `OWML.Launcher.exe` to start the game.\n\n## Requirements\n\n- The latest version of the game (1.0.7) installed (both Epic and Steam are supported);\n- A VR Headset;\n- VR controllers (not playable with a regular game controller);\n- A VR-Ready PC;\n- Steam and SteamVR installed (even if you have the Epic version);\n- For some people, it only works if SteamVR is already running before starting the game. For others, only when SteamVR is closed (SteamVR will open automatically). Try both and stick with what works for you;\n- Strong VR legs (both due to the nature of the game, and due to the glitchiness of this VR implementation).\n\n## Comfort\n\nOnly recommended for people who aren't usually prone to VR sickness:\n\n- A good portion of the game is spent spinning around in zero-g, which can be very disorienting;\n- No comfort features like teleport and snap turning were implemented;\n- Performance tends to not be that great, which can cause nausea;\n\n## VR Controller Inputs\n\nThe mod tries its best to teach you how to play the game in VR, but it's not always easy with all the hacky stuff going on:\n\n- Your headset might not have any default bindings, in which case you'll have to make your own through SteamVR;\n- You can interact with most stuff by aiming with your dominant hand laser and pressing the interact button;\n- Always pay attention to the input prompts on your hand;\n- Make sure you don't have the input prompts disabled in the game options when trying VR for the first time;\n- Depending on the hand you use to hold tools, movement or rotation will be disabled to allow you to interact with the tools functions. Controllers that have an additional trackpad will not suffer from this shortcoming (Index and old WMR controllers);\n- While using the ship tools hold down \"Grip\" on your dominant hand to switch to tool controls (beware that this can happen accidentally on Index);\n- Left hand mode swaps only some controls around, more controls can be swapped by changing the \"Inverted\" action set through SteamVR's bindings UI;\n\n## Performance\n\nThis game was not developed with VR in mind. It was also never a super lightweight game, and shoving VR down its throat isn't helping. You'll probably need to lower your quality settings to get acceptable performance.\n\nBesides lowering the graphics in-game (shadows, antialiasing and ambient occlusion are the heaviest hitters), try lowering the rendering resolution in SteamVR's settings.SteamVR defaults to 150%, try something like 100% instead. Changing resolution and V-sync in-game has no effect.\n\n### Framerate\n\nOuter Wilds was originally locked to 60 FPS. To work around this, NomaiVR forces the game's physics refresh rate to match your VR headset's refresh rate. This can have a high impact on performance. Try lowering your refresh rate through SteamVR's settings (if your headset supports this) to get a more stable framerate.\n\nIf your headset doesn't support multiple refresh rates, you can override the game's physics refresh rate in NomaiVR's options (pause the game, select Mods > NomaiVR and change Physics Refresh Rate). This will cause a disconnect between the framerate of the VR camera rotation and the framerate of the game's physics, so it's not very pleasant. Setting it to zero makes it follow your VR headset's refresh rate.\n\n## Compatibility with other mods\n\nNomaiVR affects code in pretty much the whole game, and drastically changes things in ways that are sure to break other mods. If you are having issues, make sure you disable any other mods you might have installed.\n\n## Reporting bugs / making requests\n\nSee if your problem was already reported by [searching for it in the issues list](https://github.com/Raicuparta/nomai-vr/issues?q=is%3Aissue). If you find that someone else already reported the same issue, feel free to add to it by commenting (even if the issue is already closed). Otherwise, [create a new issue](https://github.com/Raicuparta/nomai-vr/issues/new/choose) (GitHub account required).\n\n## Contributing\n\nLook through the [currently open issues](https://github.com/Raicuparta/NomaiVR/issues) and see if there's something you'd like to help with. If you find something you'd like to do, leave a comment on the issue. Fork the repo and make the changes you want. When you're done, open a PR from your fork to this one.\n\nIf you need help, leave a comment on the issue, or ask via [Discord](https://discord.gg/Sftcc9Z).\n\n## Development Setup\n\n- [Download the Outer Wilds Mod Manager](https://outerwildsmods.com/) and install it anywhere you like;\n- Install OWML using the Mod Manager;\n- Clone NomaiVR's source;\n- Open the file `NomaiVR/NomaiVR.csproj.user` in your favorite text editor;\n- Edit the entry `<GameDir>` to point to the directory where Outer Wilds is installed;\n- Edit the entry `<OwmlDir>` to point to your OWML directory (it is installed inside the Mod Manager directory);\n- Repeat this process for the file `SteamVR/SteamVR.csproj.user`;\n- Download the [AssemblyPublicizer](https://github.com/Raicuparta/AssemblyPublicizer/releases) and extract the exe anywhere;\n- Drag the file `OuterWilds\\OuterWilds_Data\\Managed\\Assembly-CSharp.dll` and drop it on top of `AssemblyPublicizer.exe`;\n- Confirm that it generated a new file `OuterWilds\\OuterWilds_Data\\Managed\\publicized_assemblies\\Assembly-CSharp_publicized.dll`;\n- Open the project solution file `NomaiVR.sln` in Visual Studio;\n- If needed, right click `References` in the Solution Explorer > Manage NuGet Packages > Update OWML to fix missing references;\n\nAfter doing this, the project references should be working. When you build the solution, the dll and json files will be copied to `[Mod Manager directory]/OWML/NomaiVR`. If this process is successful, you should see the mod show up in the Mod Manager.\n\nIf for some reason none of this is working, you might have to set everything manually:\n\n- To fix the references, right-click \"References\" in the Solution Explorer > \"Add Reference\", and add all the missing DLLs (references with yellow warning icon). You can find these DLLs in the game's directory (`OuterWilds\\OuterWilds_Data\\Managed`);\n- If Visual Studio isn't able to automatically copy the files, you'll have to copy the built dlls manually to OWML.\n\n## Special Thanks\n\n- **[amazingalek](https://github.com/amazingalek)**, for making OWML and teaching me how to mod the game to begin with;\n- **[TAImatem](https://github.com/TAImatem)** and **[misternebula](https://github.com/misternebula)**, for improving the VR patch and for helpful discussions about the game's code;\n- **Logan Ver Hoef**, for assisting us with the game's code;\n- Everyone over at the **Outer Wilds Discord** server for all the support;\n- **Mobius Digital** for making a neat game.\n\n## Help / Discuss development / Tell me about your day\n\n[Join the Outer Wilds Discord](https://discord.gg/Sftcc9Z), we have a nice `#modding` channel where you can discuss all types of things.\n","externalImages":{"RepoAssets/banner.png":"/images/external/NomaiVR/RepoAssets/banner.png","RepoAssets/patreon-button.png":"/images/external/NomaiVR/RepoAssets/patreon-button.png","RepoAssets/paypal-button.png":"/images/external/NomaiVR/RepoAssets/paypal-button.png","RepoAssets/video-thumbnail.jpg":"/images/external/NomaiVR/RepoAssets/video-thumbnail.jpg"},"mod":{"downloadUrl":"https://github.com/Raicuparta/nomai-vr/releases/download/1.2.2/Raicuparta.NomaiVR.zip","downloadCount":14249,"repo":"https://github.com/Raicuparta/NomaiVR","manifest":{"filename":"NomaiVR.dll","author":"Raicuparta","name":"NomaiVR","uniqueName":"Raicuparta.NomaiVR","description":"Outer Wilds VR mod, with full motion control support.","warning":{"title":"Follow these steps before starting the game in VR:","body":"- Disable all other mods (can heavily affect performance);\n\n- Close SteamVR (let the game open SteamVR automatically);\n\n- Make sure your headset and both of your VR controllers are connected and working;\n\n- If you have the game on Steam:\n--- Right-click Outer Wilds on your Steam library\n--- Select Properties...\n--- Disable Use Desktop Game Theatre."},"version":"1.2.2","owmlVersion":"1.0.1","requireVR":true},"version":"1.2.2"}},"__N_SSG":true}